In [2]:
import numpy as np
import pandas as pd

In [3]:
string_data= pd.Series(['aaajdkj','sdafaf',np.nan,'adafda'])
string_data

0    aaajdkj
1     sdafaf
2        NaN
3     adafda
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]#等价

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned = data.dropna()# 默认丢弃所有NA的行
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.399028       NaN       NaN
1 -0.607393       NaN       NaN
2 -0.794319       NaN  0.210721
3  0.123589       NaN -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [12]:
df.dropna()

          0         1         2
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [13]:
df.dropna(thresh=2)

          0         1         2
2 -0.794319       NaN  0.210721
3  0.123589       NaN -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [14]:
df.fillna(0)

          0         1         2
0 -1.399028  0.000000  0.000000
1 -0.607393  0.000000  0.000000
2 -0.794319  0.000000  0.210721
3  0.123589  0.000000 -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [15]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.399028  0.500000  0.000000
1 -0.607393  0.500000  0.000000
2 -0.794319  0.500000  0.210721
3  0.123589  0.500000 -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [16]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0 -1.399028  0.000000  0.000000
1 -0.607393  0.000000  0.000000
2 -0.794319  0.000000  0.210721
3  0.123589  0.000000 -0.744582
4  0.432961 -0.815332  0.538941
5  0.265612 -0.794408 -0.405922
6 -0.299212 -0.712595 -0.999276

In [17]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -1.019765 -1.357025 -0.450740
1 -0.270612  0.631953 -1.313154
2  0.124383       NaN  0.121109
3 -0.865180       NaN  1.251292
4 -0.939664       NaN       NaN
5 -0.738088       NaN       NaN

In [19]:
df.fillna(method='ffill')

          0         1         2
0 -1.019765 -1.357025 -0.450740
1 -0.270612  0.631953 -1.313154
2  0.124383  0.631953  0.121109
3 -0.865180  0.631953  1.251292
4 -0.939664  0.631953  1.251292
5 -0.738088  0.631953  1.251292

In [20]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.019765 -1.357025 -0.450740
1 -0.270612  0.631953 -1.313154
2  0.124383  0.631953  0.121109
3 -0.865180  0.631953  1.251292
4 -0.939664       NaN  1.251292
5 -0.738088       NaN  1.251292

In [21]:
data = pd.Series([1,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [55]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,3,4,4,]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [56]:
data.duplicated()b

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [57]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [58]:
data['v1'] = range(7)

In [59]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [60]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [66]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef',
                            'Bacon','pastrami','honey ham','novalox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [64]:
meat_to_animal = {'bacon':'pig',
                 'pulled pork':'pig',
                 'pastrami':'cow',
                 'corned beef':'cow',
                 'honey ham':'pig',
                 'novalox':'salmon'}

In [65]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [67]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [68]:
data = pd.Series([1,-999,2,-999,-1000,3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [69]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [72]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [73]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [75]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [83]:
transform = lambda x: x[:].upper()
transform

In [84]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [86]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [87]:
data.rename(index=str.upper,columns=str.title)

          One  Two  Three  Four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [88]:
data.rename(index={'OHIO':'INDINA'},
           columns={'three':'five'})

          one  two  five  four
INDINA      0    1     2     3
COLORADO    4    5     6     7
NEW YORK    8    9    10    11

In [89]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [90]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [91]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [92]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [93]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [94]:
group_names = ['Youth','YouthAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., YouthAdult, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 12
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [95]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.068, 0.29], (0.29, 0.51], (0.29, 0.51], (0.73, 0.95], (0.29, 0.51], ..., (0.068, 0.29], (0.29, 0.51], (0.73, 0.95], (0.068, 0.29], (0.51, 0.73]]
Length: 20
Categories (4, interval[float64]): [(0.068, 0.29] < (0.29, 0.51] < (0.51, 0.73] < (0.73, 0.95]]

In [97]:
data = np.random.randn(1000)
cats = pd.cut(data,4)

In [98]:
pd.value_counts(cats)

(-0.123, 1.276]     474
(-1.522, -0.123]    345
(1.276, 2.675]      114
(-2.927, -1.522]     67
dtype: int64

In [99]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024445    -0.024266    -0.020461    -0.014592
std       1.012765     0.959489     1.023800     0.968176
min      -2.986509    -3.213143    -3.227795    -3.243163
25%      -0.643297    -0.650434    -0.674589    -0.708326
50%      -0.013519    -0.010475     0.005960    -0.000210
75%       0.707566     0.643103     0.717782     0.652816
max       3.013521     2.829792     3.009243     2.904927

In [100]:
col = data[2]
col[np.abs(col)>3]

510   -3.227795
862   -3.007856
872    3.009243
Name: 2, dtype: float64

In [103]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
303 -0.826257 -3.213143  0.985058 -0.952848
510  0.868208  1.405027 -3.227795 -0.994866
566  0.665412 -0.222728  0.315108 -3.243163
862 -0.054597  0.760326 -3.007856  0.971496
872 -0.546114  0.468871  3.009243 -1.254881
972  3.013521  0.502048 -2.081262  1.586688

In [105]:
data[np.abs(data)>3] = np.sign(data)*3

In [106]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [107]:
sampler = np.random.permutation(5)
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [108]:
val = 'a,b, huide'
val.split(',')

['a', 'b', ' huide']

In [109]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'huide']

In [111]:
first,second,third = pieces
first + '::' + second + '::' + third

'a::b::huide'

In [112]:
'+'.join(pieces)

'a+b+huide'

In [24]:
import re
text = "fool bar\t baz \tqux"
re.split('\s+',text)

['fool', 'bar', 'baz', 'qux']

In [25]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
re.compile(pattern,flags=re.IGNORECASE).findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [26]:
data = {'Dave':'dave@google.com',
       'Steve':'steve@gmail.com',
       'Rob':'rob@gmail.com',
       'Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [27]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [29]:
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [30]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object